Dlubal.RFEM5.Guideline
Guideline parameters

Dlubal.RFEM5.Guideline.No
Number

Dlubal.RFEM5.Guideline.ID
Identifier

Dlubal.RFEM5.Guideline.Tag
Tag

Dlubal.RFEM5.Guideline.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.Guideline.WorkPlane
Work plane type

Dlubal.RFEM5.Guideline.WorkPlaneOrigin
Work plane origin

Dlubal.RFEM5.Guideline.Type
Guideline type

Dlubal.RFEM5.Guideline.Point1
First point

Dlubal.RFEM5.Guideline.Point2
Second point

Dlubal.RFEM5.Guideline.Angle
Angle φ

Dlubal.RFEM5.Guideline.Radius
Additional guideline parameter - Angle / Radius

Dlubal.RFEM5.Guideline.Description
Description